Repository: benjaminkitt/calendar
Catalog: po/extra/*.po
Languages: cs, sk

source: Calendar
cs: Kalendář
sk: Kalendár

source: View and schedule events
cs: Prohlížejte a plánujte události
sk: Prezerajte a plánujte udalosti

source: A slim, lightweight calendar app that syncs and manages multiple calendars in one place, like Google Calendar, Outlook and CalDAV.
cs: Malá a jednoduchá aplikace, umožňující synchronizaci a správu více kalendářů z jednoho místa, jako například Google Kalendáře, Outlooku a CalDAVu.
sk: Malá a jednoduchá aplikácia, ktorá umožňuje synchronizáciu a správu viacerých kalendárov na jednom mieste, ako napríklad Google Kalendár, Outlook a CalDAV.

source: Minor Updates:
cs: Drobné aktualizace:
sk: Menšie aktualizácie:

source: Updated translations
cs: Aktualizovány překlady
sk: Aktualizované preklady

source: Updated app icon
sk: Aktualizovaná ikonka aplikácie

source: Features:
cs: Funkce:
sk: Funkcie:

source: Ask for confirmation before deleting events
cs: Vyžadovat potvrzení před smazáním událostí
sk: Požadovať potvrdenie pred odstránením udalostí

source: Follow email and web links in the event description with Control + Click
cs: E-maily a odkazy na web v popisu události je možné následovat přidržením klávesy Ctrl a kliknutím na ně
sk: E-mailové a webové odkazy v popise udalostí je možné nasledovať stlačením klávesy Ctrl a kliknutím myšou

source: Fixes:
cs: Opravy:
sk: Opravy:

source: Disabled checkbox "Mark as default calendar" in calendar settings, if the calendar is read-only
cs: Pokud je daný kalendář pouze pro čtení, znepřístupněna v nastaveních pro něj zaškrtávací kolonka „Označit jako výchozí kalendář“
sk: Pokiaľ je kalendár určený iba na čítanie, začiarkovacie políčko „Označiť ako predvolený kalendár“ sa zneprístupní

source: Removed no longer needed sandbox permission for accounts service
cs: Odebráno už nepotřebné oprávnění pro přístup ke službě účtů z ohraničeného prostředí (sandbox)
sk: Odstránené už nepotrebné oprávnenie na prístup k službe účtov z kontajnerizovaného prostredia

source: Fixed potential memory leak
cs: Opraveno možné nevracení už nepoužívané paměti zpět systému (memory leak)
sk: Opravený potenciálny únik pamäte

source: Ensure Calendar runs in the background on startup
cs: Zajištěno, že při startu je Kalendář spuštěn na pozadí
sk: Zabezpečené, že sa Kalendár spustí po štarte na pozadí

source: Fix memory leak when getting timezone information
cs: Opraven únik paměti při získávání informací o časovém pásmu
sk: Opravený únik pamäte pri získavaní informácií o časovom pásme

source: Reliably read Windows-style timezones
cs: Spolehlivé načítání časových pásem ve stylu Windows
sk: Spoľahlivo čítať časové pásma Windows

source: Fix notification icons in the notification indicator
cs: Opraveny ikony upozornění v indikátoru upozornění
sk: Opravené ikonky oznámení v indikátore oznámení

source: Fix an issue where event timezones were overwritten
cs: Opraven problém kdy byla časová pásma události přepisována
sk: Vyriešenie problému, keď sa časové pásma udalosti prepísali

source: Ensure Calendar is launched when notifications are clicked
cs: Zajištěno, že když je kliknuto na upozornění, je spuštěn kalendář
sk: Zabezpečené, že sa Kalendár spustí po kliknutí na oznámenie

source: Fix broken calendar color with some online providers
cs: Opraven problém kdy byly u některý online poskytovatelů rozbité barvy kalendáře
sk: Opravená chybná farba kalendára pri niektorých online poskytovateľoch

source: Fix an issue with some all-day events
cs: Opraven problém s některými celodenními událostmi
sk: Opravená chyba s niektorými celodennými udalosťami

source: New Features:
cs: Nové vlastnosti:
sk: Nové funkcie:

source: Import ICS files from the gear menu
cs: Přidáno importování ICS souborů z nabídky pod ozubeným kolečkem
sk: Importujte ICS súbory z menu ozubeného kolieska

source: Support the dark style
cs: Podpora pro tmavý styl vzhedu
sk: Podpora tmavého štýlu

source: Properly show events on the last day of the month
cs: Správné zobrazování událostí v poslední den v měsíci
sk: Správne zobrazovať udalosti na poslednom dni v mesiaci

source: Fix end times for all-day events
cs: Opraveny časy konců pro celodenní události
sk: Opravené časy ukončenia celodenných udalostí

source: Notify for all alarms on an event
cs: Upozornění na všechny výstrahy při události
sk: Oznamovať všetky upozornenia na udalosť

source: Improved offline support
cs: Vylepšena podpora režimu práce bez připojení
sk: Vylepšená offline podpora

source: New colorful avatar fallbacks
cs: Nové náhradní barevné profilové obrázky
sk: Nový farebný obrázok ikonky používateľa

source: Include "film" as an event icon keyword
cs: Do klíčových slov ikony události přidáno „film“
sk: Pridané kľúčové slovo „film“ ako ikonku udalosti

source: Add Mint and Bubblegum to calendar color chooser
cs: Do voliče barev kalendáře přidána žvýkačková a mátová
sk: Pridané farebné odtiene Mäta a Žuvačka do výberu farby kalendára

source: Link to Online Accounts settings in the gear menu
cs: Odkaz na nastavení Účty online v nabídce pod ozubeným kolečkem
sk: Odkaz na Nastavenia online účtov v menu ozubeného kolieska

source: Performance improvements
cs: Zlepšení výkonu
sk: Vylepšenia výkonu

source: Add "Duplicate..." option to event context menu
cs: Do kontextové nabídky události přidána volba „Zduplikovat…“
sk: Pridanie možnosti „Duplikovať…“ do kontextového menu udalosti

source: Fix an issue where new events could appear twice in Calendar
cs: Opraven problém kdy se nové události v Kalendáři mohly zobrazovat dvakrát
sk: Vyriešenie problému, keď sa nové udalosti mohli v Kalendári vyskytnúť dvakrát

source: "Mark as default calendar" box is now correctly checked when editing a calendar
cs: Zaškrtávací kolonka „Označit jako výchozí kalendář“ je nyní při upravování kalendáře správně zaškrtnuto
sk: Pri úprave kalendára je teraz správne zaškrnuté políčko „Označiť ako predvolený kalendár“

source: Improvements:
cs: Vylepšení:
sk: Vylepšenia:

source: Allow modification of recurring events
cs: Umožnit upravování opakujících se událostí
sk: Povolenie úprav opakujúcich sa udalostí

source: Improve handling of week start day
cs: Vylepšeno nakládání s prvním dnem týdne
sk: Zlepšenie zaobchádzania s dňom začiatku týždňa

source: Fix timezone errors with all-day events
cs: Opraveny chyby v časových pásmech při celodenních událostech
sk: Opravenie chyby s časovými pásmami pri celodenných udalostiach

source: Don't resize the sidebar when resizing the window
cs: Neměnění velikost postranního panelu při změně velikosti okna
sk: Nemenná veľkosť bočného panela pri zmene veľkosti okna

source: Fix issues with time zones not being recognized
cs: Opraveny problémy s nerozpoznáváním časových zón
sk: Opravenie problému s nerozpoznávaním časových pásiem

source: Fix several issues with adding and removing monthly recurring events
cs: Opraveno několik problémů s přidáváním měsíčně se opakujícími událostmi
sk: Vyriešenie niekoľkých problémov s pridávaním a odstraňovaním mesačných opakujúcich sa udalostí

source: Correctly save event reminders
cs: Správně uložit připomínky událostí
sk: Správne ukladanie pripomenutia udalostí

source: Ellipsize event participant details if necessary
cs: V případě nutnosti nahradí podrobnosti o účastnících výpustky
sk: Skrátenie detailov o účastníkoch udalosti, ak je to potrebné

source: Fix unwanted rescheduling when editing event title
cs: Oprava nechtěného přeplánování při upravování názvu události
sk: Opravená nechcená zmena dátumu pri úprave názvu udalosti

source: Fix crash when editing an event with no location
cs: Oprava pádu při upravování události s nezadaným umístěním
sk: Opravený pád v prípade úpravy udalosti bez zadaného umiestnenia

source: Fix potential crash when loading events with no start or end time
cs: Oprava potenciálního pádu při načítání událostí s nezadaným časem začátku či konce
sk: Oprava potenciálneho pádu v prípade nahratia udalosti bez zadaného času začiatku alebo konca

source: Make agenda pane fill the whole space
cs: Podokno s agendou vyplní celý prostor
sk: Úprava panelu agendy pre vyplnenie priestoru

source: Set the suggested time for new events to the next whole hour
cs: Nastavit doporučený čas pro nové události na celou další hodinu
sk: Nastavenie navrhovaného času pre nové udalosti na ďalšiu celú hodinu

source: Fix issues with recurring events
cs: Opravit problémy s opakujícími se událostmi
sk: Opravenie problémov s opakujúcimi sa udalosťami

source: Present import window when opening ICS files
cs: Zobrazit okno importu při otevírání souborů ICS
sk: Pri otváraní ICS súborov sa zobrazí okno importu

source: Add a search entry for calendars
cs: Přidat záznam ve vyhledávání pro kalendáře
sk: Pridanie vyhľadávania udalostí v kalendári

source: Always use calendar icon in notifications
cs: Vždy v notifikacích používat ikonu kalendáře
sk: Vždy používať ikonu kalendára v oznámeniach

source: Agenda view can now be navigated by keyboard
cs: Pohled agendy lze nyní ovládat klávesnicí
sk: Zobrazenie agendy sa dá po novom ovládať klávesnicou

source: Right-to-left improvements
cs: Vylepšení textu z prava do leva
sk: Vylepšenia textu písaného smerom sprava doľava

source: Various UI overhauls including lime accent color
cs: Různé vylepšení uživatelského prostředí, včetně změny hlavní barvy na limetkovou
sk: Rôzne zlepšenia používateľského rozhrania, vrátane zmeny farebného odtieňa na limetkovú

source: Overall code cleanup and rewrites
cs: Obecné pročištění kódu a přepsání
sk: Celkové prečistenie a prepísanie častí kódu

source: Styling adjustments
cs: Doladění stylů
sk: Doladenie štýlov

source: Fix location panel initialization
cs: Opravit zavedení panelu lokalizace
sk: Opravená inicializácia panelu polohy

source: New translations
cs: Nové překlady
sk: Nové preklady

source: Update wingpanel-indicator-datetime settings path.
cs: Aktualizace popisu umístění nastavení wingpanel-indicator-datetime.
sk: Aktualizácia súborovej cesty nastavenia wingpanel-indicator-datetime.

source: New translations.
cs: Nové překlady.
sk: Nové preklady.

source: Various bug fixes and improvements.
cs: Různé opravy chyb a vylepšení.
sk: Rôzne opravy chýb a vylepšenia.

source: Fixes for calendar accuracy and integrity issues.
cs: Opravy chyb v přesnosti a integritě kalendáře.
sk: Opravy problémov s presnosťou a integritou kalendára.

source: Fixes exporting, importing and printing calendars.
cs: Opravuje exportování, importování a tisk kalendářů.
sk: Opravy exportu, importu a tlače kalendárov.

source: Maya;Planner;Dates;Days;Events;Calendar;ics;caldav;evolution;
cs: Maya;Plánovač;Termíny;Dny;Události;Kalendář;ics;caldav;evolution;
sk: Maya;Plánovač;Dátumy;Dni;Udalosti;Kalendár;ics;caldav;evolution;

source: Add Event
cs: Přidat událost
sk: Pridať udalosť
